{
  "items": [
    {
      "title": "Liechtenstein Life Assurance AG",
      "label": "Jun 2024 - Present",
      "position": "Full Stack Senior Software Engineer",
      "href": "https://liechtensteinlife.com",
      "content": null,
      "listings": [
        "Developed an AI-powered system for digitizing physical mail, including language detection, content classification, automated archiving, and seamless integration with the core insurance system",
        "Automated regulatory broker checks for fraud detection and data validation, resulting in an 80% time savings",
        "Jointly responsible for the strategic cloud migration of internal Software from AWS to Azure, maintaining operational stability and compliance"
      ]
    },
    {
      "title": "prosperity solutions AG",
      "label": "Mar 2022 - Jun 2024",
      "position": "Senior Software Architect",
      "href": "https://theprosperity.company",
      "content": null,
      "listings": [
        "Steered the design and agile implementation of OAuth2 secured REST APIs, providing access to life insurance data, thus enabling 25+ third-party platforms to fetch data and create life insurance applications in Python with Django",
        "Implemented SOAP APIs compliant with the German insurance standard BiPRO, connecting to various third-party platforms to deliver insurance data to brokers",
        "Managed the development and maintenance of the organization-wide life insurance API gateway, serving over 5.8 million daily requests",
        "Established and operated continuous integration and delivery pipelines using GitHub workflows and AWS CI/CD pipelines",
        "Secured multi-tier application with antivirus scanner and OAuth2 / SAML authentication mechanisms in collaboration with a remote DevOps company",
        "Successfully completed a full system penetration test conducted by a professional pen-testing company",
        "Established and managed test automation throughout the development process with over 20000 tests",
        "Conducted code reviews and mentored team members, fostering a culture of continuous learning and improvement"
      ]
    },
    {
      "title": "the prosperity company",
      "label": "Oct 2018 - Mar 2022",
      "position": "Software Developer / Senior Software Architect",
      "href": "https://theprosperity.company",
      "content": null,
      "listings": [
        "Worked in a high-performing team as the lead architect/engineer, responsible for third-party APIs providing access to life insurance data, facilitating third-party platforms to create quotes, offers, and life insurance applications via API in Python with Django",
        "Successfully led a cross-functional team of 7, responsible for creating a B2C web application using JavaScript with Node.js and Python with Falcon for backend, React for frontend and React Native for mobile application development. The project led to 40% of customers using the application within the first year of its launch"
      ]
    },
    {
      "title": "sde ventures est.",
      "label": "Jul 2018 - Oct 2018",
      "position": "Software Developer",
      "href": "https://sde.li",
      "content": null,
      "listings": [
        "Developed a microservice architecture from scratch using JavaScript on Node.js and Python specifically for the insurance sector",
        "Utilized AWS Pipeline for CI/CD, enhancing the efficiency and reliability of software builds and deployments",
        "Collaborated with remote developers and designers in Hungary, India, and Germany, fostering a global and inclusive work culture"
      ]
    },
    {
      "title": "Parental Leave",
      "label": "Apr 2017 - Jul 2018",
      "position": "Dad",
      "href": null,
      "content": null,
      "listings": [
        "Cooking, housekeeping, professional diaper changing",
        "Late night and weekend coder"
      ]
    },
    {
      "title": "xoo design gmbh",
      "label": "Apr 2013 - Apr 2017",
      "position": "Senior Software Developer",
      "href": "https://xoo.cc",
      "content": null,
      "listings": [
        "Responsible for software design and architecture of the in house application framework which successfully empowered more than 100 customers with a professional responsive multilingual website with shop integration, document center, BPMN workflow manager, etc.",
        "Continuous controlling, refactoring and testing of code of team members to ensure functionality and growing skills of the team",
        "Requirements engineering and project management in collaboration with customers",
        "Trouble solving for customers ",
        "Supervision of interns",
        "Continuous refactoring of a plenty of legacy code",
        "Development with in-house frameworks, Symfony and Silex"
      ]
    },
    {
      "title": "StyleAddicted AG",
      "label": "Apr 2016 - Jun 2016",
      "position": "Freelancer",
      "href": null,
      "content": null,
      "listings": [
        "Implementation of an Instagram API as SAAS in python by using the django rest framework.",
        "Automatic fetching and analysis of Instagram user data with in a multi threaded environment using celery and redis."
      ]
    },
    {
      "title": "Montoya Gourmet Gmbh",
      "label": "Jul 2014 - Aug 2014",
      "position": "Freelancer",
      "href": null,
      "content": null,
      "listings": [
        "Development (Configuration) of a WordPress Website with WooCommerce Webshop.",
        "Implementation of a WordPress WooCommerce Plugin for handling a dynamic sales limit for the whole shop to ensure the company is still a small company by law."
      ]
    },
    {
      "title": "Autohaus Günter Schmid",
      "label": "Apr 2013 - May 2013",
      "position": "Freelancer",
      "href": "http://www.mazda-schmid.at",
      "listings": [
        "Development of a real-time application for handling daily orders of customers of a car service station with the ASP.NET framework and MS Sql Server in C#"
      ]
    },
    {
      "title": "Stahlmanufaktur Gmbh",
      "label": "Apr 2011 - Okt 2011",
      "position": "Freelancer",
      "href": null,
      "content": null,
      "listings": [
        "Development of a custom CMS and Website with PHP and Symfony 2.0."
      ]
    },
    {
      "title": "xoo design gmbh",
      "label": "Oct 2010 - Feb 2013",
      "position": "Full Stack Junior Software Developer",
      "href": "https://xoo.cc",
      "content": null,
      "listings": [
        "Extending of existing and development of new applications by using the in-house PHP framework.",
        "Programming of native android applications"
      ]
    },
    {
      "title": "Internship at Vrz Informatik GmbH CC-Solution",
      "label": "Feb 2010 - Apr 2010",
      "position": "Intern",
      "href": "http://www.vrz.net",
      "content": null,
      "listings": [
        "Extension of an Enterprise Architect® Addin for internal usage. (UML, Graph-Traversal, Webservices) in C#",
        "Implementation of a RoutingAgent for Exchange Server 2010 in C# and PowerShell Script",
        "Development of a number to word engine for german language in C#"
      ]
    }
  ]
}
